The following situations were tested with a minimal configuration using Postgres and a custom parameter group with `create_before_destroy` lifecycle configuration.

- Parameter group replacement with new group
- Parameter group name_prefix change
- Minor version engine upgrade + parameter group name_prefix change
- Major version engine upgrade + parameter group family upgrade

In each case, the [`create_before_destroy`](https://developer.hashicorp.com/terraform/language/meta-arguments/lifecycle#create_before_destroy) directive prevented destruction of the in-use parameter group, and resulted in a successful first time `apply`. Given this solution has also worked for some practitioners based on this issue's comments, a proposed resolution to this issue is to add documentation around this lifecycle argument in the context of the [`aws_db_parameter_group` resource](https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/db_parameter_group).

To allow time for feedback on the reproduction and documentation changes, we're going to leave this issue open. If no objections are received we will close this as completed in the near future.

A more detailed breakdown of the minimal reproduction is included below:


## Config


<details>
  <summary>Show</summary>

### Parameter group swap (original issue)

```terraform
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 4.0"
    }
  }
}

provider "aws" {}


#resource "aws_db_parameter_group" "repro" {
  #name_prefix = "jb-test"
  #family      = "postgres13"

  #parameter {
    #name  = "log_connections"
    #value = "1"
  #}

  #lifecycle {
    #create_before_destroy = true
  #}
#}

resource "aws_db_parameter_group" "repro-new" {
  name_prefix = "jb-test-new"
  family      = "postgres13"

  parameter {
    name  = "log_connections"
    value = "1"
  }

  lifecycle {
    create_before_destroy = true
  }
}

resource "aws_db_instance" "repro" {
  identifier           = "jb-test"
  instance_class       = "db.t3.micro"
  allocated_storage    = 10
  engine               = "postgres"
  engine_version       = "13.7"
  username             = "jb"
  password             = "testtest"
  parameter_group_name = aws_db_parameter_group.repro-new.name # was: aws_db_parameter_group.repro.name

  apply_immediately           = true
  allow_major_version_upgrade = true
  skip_final_snapshot         = true
  backup_retention_period     = 1
}

```

### Engine version upgrade (subsequent comments)

```terraform
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 4.0"
    }
  }
}

provider "aws" {}


resource "aws_db_parameter_group" "repro" {
  name_prefix = "jb-test" # "jb-test-nameupdate"
  family      = "postgres13" # "postgres12"

  parameter {
    name  = "log_connections"
    value = "1"
  }

  lifecycle {
    create_before_destroy = true
  }
}

resource "aws_db_instance" "repro" {
  identifier           = "jb-test"
  instance_class       = "db.t3.micro"
  allocated_storage    = 10
  engine               = "postgres"
  engine_version       = "13.7" # "12.7", "12.8"
  username             = "jb"
  password             = "testtest"
  parameter_group_name = aws_db_parameter_group.repro.name

  apply_immediately           = true
  allow_major_version_upgrade = true
  skip_final_snapshot         = true
  backup_retention_period     = 1
}

```

</details>

## Reproduction Details

<details>
  <summary>Show</summary>

```console
$ terraform -v
Terraform v1.3.3
on darwin_arm64
+ provider registry.terraform.io/hashicorp/aws v4.36.1
```


### Parameter group replacement with new group

```
$ terraform apply -auto-approve
aws_db_parameter_group.repro: Refreshing state... [id=jb-test20221026190006702200000001]
aws_db_instance.repro: Refreshing state... [id=jb-test]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_db_instance.repro will be updated in-place
  ~ resource "aws_db_instance" "repro" {
        id                                    = "jb-test"
      ~ parameter_group_name                  = "jb-test20221026190006702200000001" -> (known after apply)
        tags                                  = {}
        # (48 unchanged attributes hidden)
    }

  # aws_db_parameter_group.repro will be destroyed
  # (because aws_db_parameter_group.repro is not in configuration)
  - resource "aws_db_parameter_group" "repro" {
      - arn         = "arn:aws:rds:us-west-2:<account-id>:pg:jb-test20221026190006702200000001" -> null
      - description = "Managed by Terraform" -> null
      - family      = "postgres13" -> null
      - id          = "jb-test20221026190006702200000001" -> null
      - name        = "jb-test20221026190006702200000001" -> null
      - name_prefix = "jb-test" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null

      - parameter {
          - apply_method = "immediate" -> null
          - name         = "log_connections" -> null
          - value        = "1" -> null
        }
    }

  # aws_db_parameter_group.repro-new will be created
  + resource "aws_db_parameter_group" "repro-new" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "postgres13"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "jb-test-new"
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
aws_db_parameter_group.repro-new: Creating...
aws_db_parameter_group.repro-new: Creation complete after 3s [id=jb-test-new20221026192236273200000001]
aws_db_instance.repro: Modifying... [id=jb-test]
aws_db_instance.repro: Still modifying... [id=jb-test, 10s elapsed]
...
aws_db_instance.repro: Still modifying... [id=jb-test, 1m40s elapsed]
aws_db_instance.repro: Modifications complete after 1m42s [id=jb-test]
aws_db_parameter_group.repro: Destroying... [id=jb-test20221026190006702200000001]
aws_db_parameter_group.repro: Destruction complete after 1s

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.
```

### Parameter group name_prefix change

```
$ terraform apply -auto-approve
aws_db_parameter_group.repro: Refreshing state... [id=jb-test20221026175055326400000001]
aws_db_instance.repro: Refreshing state... [id=jb-test]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_db_instance.repro will be updated in-place
  ~ resource "aws_db_instance" "repro" {
        id                                    = "jb-test"
      ~ parameter_group_name                  = "jb-test20221026175055326400000001" -> (known after apply)
        tags                                  = {}
        # (48 unchanged attributes hidden)
    }

  # aws_db_parameter_group.repro must be replaced
+/- resource "aws_db_parameter_group" "repro" {
      ~ arn         = "arn:aws:rds:us-west-2:<account-id>:pg:jb-test20221026175055326400000001" -> (known after apply)
      ~ id          = "jb-test20221026175055326400000001" -> (known after apply)
      ~ name        = "jb-test20221026175055326400000001" -> (known after apply)
      ~ name_prefix = "jb-test" -> "jb-test-nameupdate" # forces replacement
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
aws_db_parameter_group.repro: Creating...
aws_db_parameter_group.repro: Creation complete after 2s [id=jb-test-nameupdate20221026181552324300000001]
aws_db_instance.repro: Modifying... [id=jb-test]
aws_db_instance.repro: Still modifying... [id=jb-test, 10s elapsed]
...
aws_db_instance.repro: Still modifying... [id=jb-test, 1m50s elapsed]
aws_db_instance.repro: Modifications complete after 1m52s [id=jb-test]
aws_db_parameter_group.repro (deposed object f44351d0): Destroying... [id=jb-test20221026175055326400000001]
aws_db_parameter_group.repro: Destruction complete after 0s

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.
```

### Minor version engine upgrade

```
$ terraform apply -auto-approve
aws_db_parameter_group.repro: Refreshing state... [id=jb-test-new20221026152940374700000001]
aws_db_instance.repro: Refreshing state... [id=jb-test]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_db_instance.repro will be updated in-place
  ~ resource "aws_db_instance" "repro" {
      ~ engine_version                        = "12.7" -> "12.8"
        id                                    = "jb-test"
      ~ parameter_group_name                  = "jb-test-new20221026152940374700000001" -> (known after apply)
        tags                                  = {}
        # (47 unchanged attributes hidden)
    }

  # aws_db_parameter_group.repro must be replaced
+/- resource "aws_db_parameter_group" "repro" {
      ~ arn         = "arn:aws:rds:us-west-2:<account-id>:pg:jb-test-new20221026152940374700000001" -> (known after apply)
      ~ id          = "jb-test-new20221026152940374700000001" -> (known after apply)
      ~ name        = "jb-test-new20221026152940374700000001" -> (known after apply)
      ~ name_prefix = "jb-test-new" -> "jb-test" # forces replacement
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
aws_db_parameter_group.repro: Creating...
aws_db_parameter_group.repro: Creation complete after 2s [id=jb-test20221026154901009300000001]
aws_db_instance.repro: Modifying... [id=jb-test]
aws_db_instance.repro: Still modifying... [id=jb-test, 10s elapsed]
...
aws_db_instance.repro: Still modifying... [id=jb-test, 16m54s elapsed]
aws_db_instance.repro: Modifications complete after 16m58s [id=jb-test]
aws_db_parameter_group.repro (deposed object 2431087f): Destroying... [id=jb-test-new20221026152940374700000001]
aws_db_parameter_group.repro: Destruction complete after 0s

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.
```

### Major version engine upgrade

```
$ terraform apply -auto-approve
aws_db_parameter_group.repro: Refreshing state... [id=jb-test20221026154901009300000001]
aws_db_instance.repro: Refreshing state... [id=jb-test]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_db_instance.repro will be updated in-place
  ~ resource "aws_db_instance" "repro" {
      ~ engine_version                        = "12.8" -> "13.7"
        id                                    = "jb-test"
      ~ parameter_group_name                  = "jb-test20221026154901009300000001" -> (known after apply)
        tags                                  = {}
        # (47 unchanged attributes hidden)
    }

  # aws_db_parameter_group.repro must be replaced
+/- resource "aws_db_parameter_group" "repro" {
      ~ arn         = "arn:aws:rds:us-west-2:<account-id>:pg:jb-test20221026154901009300000001" -> (known after apply)
      ~ family      = "postgres12" -> "postgres13" # forces replacement
      ~ id          = "jb-test20221026154901009300000001" -> (known after apply)
      ~ name        = "jb-test20221026154901009300000001" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
aws_db_parameter_group.repro: Creating...
aws_db_parameter_group.repro: Creation complete after 2s [id=jb-test20221026175055326400000001]
aws_db_instance.repro: Modifying... [id=jb-test]
aws_db_instance.repro: Still modifying... [id=jb-test, 10s elapsed]
...
aws_db_instance.repro: Still modifying... [id=jb-test, 18m20s elapsed]
aws_db_instance.repro: Modifications complete after 18m23s [id=jb-test]
aws_db_parameter_group.repro (deposed object 8e7ac9c5): Destroying... [id=jb-test20221026154901009300000001]
aws_db_parameter_group.repro: Destruction complete after 0s

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.
```

</details>